# Mentos Zindagi!

In [9]:
from sklearn.compose import ColumnTransformer
import pandas as pd
from sklearn.preprocessing import OneHotEncoder,LabelEncoder,OrdinalEncoder

In [50]:
df=pd.read_csv('Datasets/titanic.csv')

In [42]:
df.head()

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [73]:
temp[1]

array([0.0, 0.0, 0.0, 0.0, 0.0, 1, 2, 1,
       'Cumings, Mrs. John Bradley (Florence Briggs Thayer)', 38.0, 1, 0,
       'PC 17599', 71.2833, 'C85'], dtype=object)

In [72]:
temp[2]

array([0.0, 0.0, 1.0, 0.0, 2.0, 2, 3, 1, 'Heikkinen, Miss. Laina', 26.0,
       0, 0, 'STON/O2. 3101282', 7.925, nan], dtype=object)

In [47]:
df['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [44]:
transformer=ColumnTransformer(transformers=[
    ('tnf1',OneHotEncoder(drop='first'),['Sex','Embarked']),
    ('tnf2',OrdinalEncoder(categories=[['1','2','3']]),['Pclass'])
],remainder='passthrough')

In [70]:
temp=transformer1.fit_transform(df)

C:\Users\Admin\AppData\Local\Programs\Python\Python310\lib\site-packages\sklearn\preprocessing\_encoders.py:975: FutureWarning: `sparse` was renamed to `sparse_output` in version 1.2 and will be removed in 1.4. `sparse_output` is ignored unless you leave `sparse` to its default value.
  warnings.warn(

In [15]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(df.iloc[:,3:],df.iloc[:,3:4],test_size=.2)

In [43]:
X_train.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
193,2,"Navratil, Master. Michel M",male,3.0,1,1,230080,26.0000,F2,S
681,1,"Hassab, Mr. Hammad",male,27.0,0,0,PC 17572,76.7292,D49,C
673,2,"Wilhelms, Mr. Charles",male,31.0,0,0,244270,13.0000,NaN,S
770,3,"Lievens, Mr. Rene Aime",male,24.0,0,0,345781,9.5000,NaN,S
649,3,"Stanley, Miss. Amy Zillah Elsie",female,23.0,0,0,CA. 2314,7.5500,NaN,S

In [45]:
train_cleaned=transformer.fit_transform(X_train)

In [46]:
train_cleaned[0]

array([1.0, 0.0, 1.0, 0.0, 1.0, 'Navratil, Master. Michel M', 3.0, 1, 1,
       '230080', 26.0, 'F2'], dtype=object)

In [18]:
y_train.shape

(712, 1)

In [19]:
y_test.shape

(179, 1)

In [36]:
train_cleaned=transformer.fit_transform(X_train)

In [74]:
train_cleaned[0:5]

array([[1.0, 0.0, 1.0, 0.0, 1.0, 'Navratil, Master. Michel M', 3.0, 1, 1,
        '230080', 26.0, 'F2'],
       [1.0, 0.0, 0.0, 0.0, 0.0, 'Hassab, Mr. Hammad', 27.0, 0, 0,
        'PC 17572', 76.7292, 'D49'],
       [1.0, 0.0, 1.0, 0.0, 1.0, 'Wilhelms, Mr. Charles', 31.0, 0, 0,
        '244270', 13.0, nan],
       [1.0, 0.0, 1.0, 0.0, 2.0, 'Lievens, Mr. Rene Aime', 24.0, 0, 0,
        '345781', 9.5, nan],
       [0.0, 0.0, 1.0, 0.0, 2.0, 'Stanley, Miss. Amy Zillah Elsie', 23.0,
        0, 0, 'CA. 2314', 7.55, nan]], dtype=object)